alexey907/STM32Test/src/main.cpp
#include <cstring>
#include "stm32f1xx_hal.h"
#include "FreeRTOS.h"
#include "task.h"
#include "USBSerial.h"
#include "BleSerial.h"

void SystemClock_Config(void);
void MX_GPIO_Init(void);

void SystemClock_Config(void) {
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    // Configure HSE oscillator
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;  // 8MHz * 9 = 72MHz
    HAL_RCC_OscConfig(&RCC_OscInitStruct);

    // Configure clock tree
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
                                | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
    HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2);

    // USB clock: 72MHz PLL / 1.5 = 48MHz required for USB Full-Speed
    RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};
    PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USB;
    PeriphClkInit.UsbClockSelection = RCC_USBCLKSOURCE_PLL_DIV1_5;
    HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit);
}

void MX_GPIO_Init(void) {
    __HAL_RCC_GPIOB_CLK_ENABLE();
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin = GPIO_PIN_2;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
}

//--------------------------------------------------------------------+
//  Blink Task
//--------------------------------------------------------------------+

void StartBlinkTask(void *argument) {
    (void)argument;
    for (;;) {
        HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_2);
        USBSerial::println("Led Blink");
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

//--------------------------------------------------------------------+
//  BleSerial Ping-Pong Command Task
//--------------------------------------------------------------------+
//  Demonstrates the zero-copy JDY‑23 bridge:
//    - Task blocks at 0% CPU until the ISR gives rx_semaphore
//    - Reads the incoming command directly from BleSerial::cmd_buffer
//    - Responds via DMA TX (ping-pong protocol guarantees cmd_buffer
//      won't be overwritten until after the response is sent)
//--------------------------------------------------------------------+

void TelemetryTask(void *argument) {
    (void)argument;

    BleSerial::begin(115200);

    for (;;) {
        // Block until ISR signals a complete line has arrived
        if (xSemaphoreTake(BleSerial::rx_semaphore, portMAX_DELAY) == pdTRUE) {

            // Read string directly from the static shared buffer
            if (strncmp(BleSerial::cmd_buffer, "AT+PING", 7) == 0) {
                BleSerial::print("OK\r\n");
            } else {
                BleSerial::print("ERROR\r\n");
            }
        }
    }
}

//--------------------------------------------------------------------+
//  FreeRTOS hooks
//--------------------------------------------------------------------+

void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName) {
    (void)xTask;
    (void)pcTaskName;
    taskDISABLE_INTERRUPTS();
    for (;;) {}
}

void vApplicationMallocFailedHook(void) {
    taskDISABLE_INTERRUPTS();
    for (;;) {}
}

//--------------------------------------------------------------------+
//  Entry point
//--------------------------------------------------------------------+

int main(void) {
    HAL_Init();
    SystemClock_Config();
    MX_GPIO_Init();

    xTaskCreate(USBSerial::task, "USB", 256, NULL, configMAX_PRIORITIES - 1, NULL);
    xTaskCreate(StartBlinkTask, "Blink", 128, NULL, 1, NULL);
    xTaskCreate(TelemetryTask, "Telemetry", 256, NULL, 2, NULL);

    vTaskStartScheduler();

    while (1) {}
}